#language: ru
Функционал: Ипотека

  @web
  Сценарий: Ипотечный калькулятор

    * подтвержден регион
    * выбран пункт меню "Ипотека"
    * выбран подпункт меню "Ипотечный калькулятор"
    * на странице присутствует заголовок "Ипотечный калькулятор"
    * выполнено нажатие на "Знаю свою ипотечную программу"
    * выпадающий список "Город" заполняется значением "Москва"
    * выпадающий список "Вид ипотечной программы" заполняется значением "Квартира на вторичном рынке"
    * выпадающий список "Я являюсь" заполняется значением "Новый клиент"
    * выпадающий список "Уровень доходов подтверждаю" заполняется значением "Справка по форме Банка"
    * поле "В банке возьму" заполняется значением "3000000"
    * поле "Первоначальный взнос" заполняется значением "3500000"
    * поле "Срок кредита" заполняется значением "10"
    * выполнено нажатие на "Рассчитать"
    * значение поля "Ежемесячный платеж" равно "40 656.67 руб."
    * значение поля "Общая сумма выплат" равно "4 836 815.44 руб."
    * значение поля "Cумма выплат по процентам" равно "1 836 815.44 руб."
    * значение поля "Процентная ставка" равно "10.49 %"
